app/views/admin/attendance.erb

SELECT DISTINCT "attendances"."date" FROM "attendances"  ORDER BY "attendances"."date" ASC
---
              <a href="#add_attendance" data-toggle="modal" class="btn btn-info btn-lg btn-block" ><span class="glyphicon glyphicon-plus" aria-hidden="true"></span></a>
              <% Attendance.select(:date).uniq.order(:date).each do |s|%>

SELECT "users".* FROM "users"
---
                <tbody>
                  <% User.all.each do |user|%>

SELECT "attendances".* FROM "attendances" WHERE (user_id=1)  ORDER BY "attendances"."date" ASC
---
                      <td><%= user.name %></td><!--name-->
                      <% Attendance.where("user_id=?", user.id).order(:date).each do |s|%>

SELECT "attendances".* FROM "attendances" WHERE (user_id=1)
---
              <tbody>
                <% Attendance.where("date = ?", s.date).each do |att|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
                    <td><%= att.user_id %></td>
                    <td><%= User.find(att.user_id).name%></td>