app/views/admin/signup_person.erb

SELECT "users".* FROM "users"
---
            <tbody>
              <% User.all.each do |user|%>