app/views/home/hey.erb

SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" DESC LIMIT 5
---
            <br><br>
            <% Project.last(5).reverse_each do |f|%>

SELECT  "posts".* FROM "posts" WHERE (category = '공지사항')  ORDER BY "posts"."id" DESC LIMIT 5
---
                <%end%>
                <% Post.where("category = ?", "공지사항").last(5).reverse_each do |f|%>

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
                          <p><%=f.title%></p>
                          <strong class="primary-font"><%=User.find(f.user).name%></strong>