app/views/home/main.html.erb

            <div class="list-group" align="left">
              <% Post.where("category = ?", "공지사항").last(5).reverse_each do |f|%>
---
SELECT  "posts".* FROM "posts" WHERE (category = '공지사항')  ORDER BY "posts"."id" DESC LIMIT 5

            <div class="list-group" align="left">
              <% Project.last(5).reverse_each do |f|%>
---
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" DESC LIMIT 5

            <div align="right">
              <% if Project.count == 0%>
---
SELECT COUNT(*) FROM "projects"


<% Popup.last(1).each do |pop|%>
---
SELECT  "popups".* FROM "popups"  ORDER BY "popups"."id" DESC LIMIT 1