app/views/post/main.html.erb

                <tbody>
                  <% Post.where("category = ?", "공지사항").reverse_each do |a| %>
---
SELECT "posts".* FROM "posts" WHERE (category = '공지사항')

                        <td><%= a.id %></td>
                        <td><a href="/post/view?id=<%= a.id %>"><%= a.title %> (<%=a.replies.count%>)</a></td>
                        <td><% if User.where("id=?",a.user).exists?%>
---
SELECT COUNT(*) FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]