app/views/post/view.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                  <div class="panel-body">
                    <h4><%= @view_post.title %> <small>_ <% if User.where("id=?",@view_post.user).exists?%><%=User.find(@view_post.user).name%><%else%>탈퇴한 유저<%end%></small></h4>

SELECT "replies".* FROM "replies" WHERE "replies"."post_id" = ?  [["post_id", 1]]
---
                      <tbody>
                        <% @view_post.replies.each do |r| %>