app/views/community/main.erb

                  <% if @posting == "all" %>
                    <% Post.where("category = ? or category =?", "잡담", "아이디어").reverse_each do |a| %>
---
SELECT "posts".* FROM "posts" WHERE (category = '잡담' or category ='아이디어')

<<<<<<< HEAD
                        <td><%=User.find(a.user).name%></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]