app/views/project/main.erb

                <div class="list-group table-of-contents" align="left">
                  <% Project.all.each do |p|%>
---
SELECT "projects".* FROM "projects"


                <% if Project.count == 0 %><!--프로젝트가 등록된게 없으면-->
---
SELECT COUNT(*) FROM "projects"

                    <div class="panel-body">
                      <h4><%= @view_post.title %> <small>_ <%=User.find(@view_post.writer).name%></small></h4>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]