app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def delete_user
    @user = User.find(params[:id])

    @user.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "박지연"], ["updated_at", "2016-05-11 11:13:33.691757"], ["id", 1]]
---
  def edit_user
    @user = User.find(params[:id])
    @user.name = params[:name]
    @user.save

SELECT "users".* FROM "users"
INSERT INTO "attendances" ("user_id", "state", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["state", "출석"], ["date", "2016-05-08"], ["created_at", "2016-05-11 10:08:14.020696"], ["updated_at", "2016-05-11 10:08:14.020696"]]
---
  def attendance_write

    User.all.each do |user|
      # @select = ("select_" + user.id.to_s).to_s
      new_attendance = Attendance.new
      new_attendance.user_id = user.id
      new_attendance.state = params["select_#{user.id}"]
      new_attendance.date = params[:date]
      new_attendance.save

SELECT "users".* FROM "users"
SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "attendances" SET "state" = ?, "updated_at" = ? WHERE "attendances"."id" = ?  [["state", "결석"], ["updated_at", "2016-05-11 10:56:59.383920"], ["id", 1]]
---
  def attendance_modify #수정할것
    User.all.each do |user|
      edit = Attendance.find(params["id_#{user.id}"])
      edit.state = params["select_#{user.id}"] #상태 업데이트
      edit.save

INSERT INTO "popups" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "안녕하세요 반갑습니다\r\n\r\n팝업입니다."], ["created_at", "2016-05-12 04:51:25.956515"], ["updated_at", "2016-05-12 04:51:25.956515"]]
---
  def popup
    Popup.all.each do |pop|
      popup = Popup.find(pop.id)
      popup.checking = "false"
      popup.save
    end

    popup = Popup.new
    popup.content = params[:content]
    popup.checking =params[:checking]
    popup.save