app/controllers/community_controller.rb

INSERT INTO "posts" ("title", "user", "category", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "cvc"], ["user", 1], ["category", "아이디어"], ["content", "vdfdf"], ["created_at", "2016-04-22 14:31:49.111992"], ["updated_at", "2016-04-22 14:31:49.111992"]]
---
  def write_process #글쓰기 처리
    @new_post = Post.new
    @new_post.title = params[:title]
    @new_post.user = params[:user]
    @new_post.category = params[:category]
    @new_post.content = params[:content]
    @new_post.save