app/controllers/post_controller.rb

INSERT INTO "posts" ("title", "user", "category", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "dfdf"], ["user", 1], ["category", "공지사항"], ["content", "dfdf"], ["created_at", "2016-04-22 15:08:11.958109"], ["updated_at", "2016-04-22 15:08:11.958109"]]
---
  def write_process #글쓰기 처리
    @new_post = Post.new
    @new_post.title = params[:title]
    @new_post.user = params[:user]
    @new_post.category = params[:category]
    @new_post.content = params[:content]
    @new_post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def view # 글보기

      @view_post = Post.find(params[:id])