app/controllers/project_controller.rb

SELECT COUNT(*) FROM "projects"
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 1]]
---
  def main
    if Project.count != 0
      @view_post=Project.find(params[:view_post])

INSERT INTO "projects" ("title", "writer", "team_leader", "team_member", "content", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."id" DESC LIMIT 1
---
  def write_process

    new = Project.new
    new.title = params[:title]
    new.writer = current_user.id
    new.team_leader = params[:team_leader]
    new.team_member = params[:team_member]
    new.content = params[:content]
    new.address = params[:address]
    # new.image = params[:image] #이미지파일 저장
    new.save

    redirect_to action: "main", view_post: Project.last.id